perf/exchange-test.yml
config:
  target: "http://localhost:5555"   # o el host de tu servicio si está en Docker
  phases:
    - duration: 60    # prueba de 1 minuto
      arrivalRate: 5  # 5 requests por segundo
    - duration: 60
      arrivalRate: 20 # subimos la carga a 20 rps
    - duration: 60
      arrivalRate: 50 # stress test a 50 rps
  plugins:
    statsd:
      host: "localhost"  # nombre del contenedor Graphite en docker-compose
      port: 8125
      prefix: "artillery-api"

scenarios:
  - name: "Exchange USD->ARS"
    flow:
      - post:
          url: "/exchange"
          json:
            baseCurrency: "USD"
            counterCurrency: "ARS"
            baseAmount: 100
            baseAccountId: 11
            counterAccountId: 10

  - name: "Consultar rates"
    flow:
      - get:
          url: "/rates"

  - name: "Consultar cuentas"
    flow:
      - get:
          url: "/accounts"